using System.Data.Entity;
using System.Security.Claims;
using System.Threading.Tasks;
using Microsoft.AspNet.Identity;
using Microsoft.AspNet.Identity.EntityFramework;
using System.ComponentModel.DataAnnotations;
using System;

namespace VolunteerSystem.Models
{
    public enum States
    {
        Вінницька = 1, Волинська, Дніпропетровська, Житомирська,
        Закарпатська, Запорізька, [Display(Name = "Івано-Франківська")]
        ІваноФранківська, Київська, Кіровоградська, Львівська,
        Миколаївська, Одеська, Полтавська, Рівненська, Сумська, Тернопільська, Харківська, Херсонська, Хмельницька,
        Черкаська, Чернівецька, Чернігівська
    }

    public enum Cities
    {
        Бар = 1, Бершадь, Вінниця, Гайсин, Гнівань, Жмеринка, Іллінці, Калинівка, Козятин, Ладижин, Липовець, 
        [Display(Name = "Могилів-Подільський")]МогилівПодільський, Немирів, Погребище, Тульчин, Хмільник, Шаргород,
        Ямпіль, Берестечко = 19, [Display(Name = "Володимир-Волинський")]ВолодимирВолинський, Горохів,
        [Display(Name = "Камінь-Каширський")]КаміньКаширський, Ківерці, Ковель, Луцьк, Любомль, Нововолинськ, Рожище,
        Устилуг, Апостолове = 30, Верхівцеве, Верхньодніпровськ, Вільногірськ, Дніпродзержинськ, Дніпропетровськ, 
        [Display(Name = "Жовті Води")]ЖовтіВоди, Зеленодольськ, [Display(Name = "Кривий Ріг")]КривийРіг, Марганець,
        Нікополь, Новомосковськ, Орджонікідзе, [Display(Name = "П'ятихатки")]Пятихатки, Павлоград, Перещепине,
        Першотравенськ, Підгородне, Синельникове, Тернівка, Андрушівка = 50, Баранівка, Бердичів, Житомир, Коростень,
        Коростишів, Малин, [Display(Name = "Новоград-Волинський")]НовоградВолинський, Овруч, Олевськ, Радомишль, Чуднів,
        Берегове = 62, Виноградів, Іршава, Мукачеве, Перечин, Рахів, Свалява, Тячів, Ужгород, Хуст, Чоп, Бердянськ = 73,
        Василівка, Вільнянськ, Гуляйполе, Дніпрорудне, Енергодар, Запоріжжя,
        [Display(Name = "Кам'янка-Дныпровська")]КамянкаДніпровська, Мелітополь, Молочанськ, Оріхів, Пологи, Приморськ, 
        Токмак, Болехів = 87, Бурштин, Галич, Городенка, Долина, [Display(Name = "Івано-Франківськ")]ІваноФранківськ,
        Калуш, Коломия, Косів, Надвірна, Рогатин, Снятин, Тисмениця, Тлумач, Яремче, [Display(Name = "м. Київ")]Київ = 102,
        Березань, [Display(Name = "Біла Церква")]БілаЦерква, Богуслав, Бориспіль, Боярка, Бровари, Буча, Васильків, Вишгород,
        Вишневе, Ірпінь, Кагарлик, Миронівка, Обухів, [Display(Name = "Переяслав-Хмельницький")]ПереяславХмельницький,
        Ржищів, Сквира, Славутич, Тараща, Тетіїв, Узин, Українка, Фастів, Яготин, Бобринець = 127, Гайворон, Долинська, [Display(Name = "Знам'янка")]Знамянка, Кіровоград,
        [Display(Name = "Мала Виска")]МалаВиска, Новомиргород, Новоукраїнка, Олександрія, Помічна, Світловодськ, Ульяновка,
        Белз = 140, Бібрка, Борислав, Броди, Буськ, [Display(Name = "Великі Мости")]ВеликіМости, Винники, Глиняни, Городок,
        Добромиль, Дрогобич, Дубляни, Жидачів, Жовква, Золочів, [Display(Name = "Кам'янка-Бузька")]КамянкаБузька, Комарно,
        Львів, Миколаїв, Моршин, Мостиська, [Display(Name = "Новий Калинів")]НовийКалинів,
        [Display(Name = "Новий Розділ")]НовийРозділ, Новояворівськ, Перемишляни, Пустомити, [Display(Name = "Рава-Руська")]РаваРуська,
        Радехів, Рудки, Самбір, Сколе, Сокаль, Соснівка, [Display(Name = "Старий Самбір")]СтарийСамбір, Стебник, Стрий,
        [Display(Name = "Судова Вишня")]СудоваВишня, Трускваець, Турка, Угнів, Хирів, Ходорів, Червоноград, Яворів,
        Баштанка = 184, Вознесенськ, Микoлаїв, [Display(Name = "Нова Одеса")]НоваОдеса, [Display(Name = "Новий Буг")]НовийБуг,
        Очаків, Первомайськ, Снігурівка, Южноукраїнськ, Ананьїв = 193, Арциз, Балта, Березівка,
        [Display(Name = "Білгород-Дністровський")]БілгородДністровський, Біляївка, Болград, Вилкове, Ізмаїл, Іллічівськ,
        Кілія, Кодима, Котовськ, Одеса, Рені, Роздільна, Татарбунари, Теплодар, Южне, Гадяч = 212, Глобине, Гребінка, Зіньків,
        Карлівка, Кобеляки, Комсомольськ, Кременчук, Лохвиця, Лубни, Миргород, Пирятин, Полтава, Хорол, Червонозаводське,
        Березне = 227, Дубно, Дубровиця, Здолбунів, Корець, Костопіль, Кузнецовськ, Острог, Радивилів, Рівне, Сарни, Білопілля = 238, 
        Буринь, Ворожба, Глухів, Дружба, Конотоп, Кролевець, Лебедин, Охтирка, Путивль, Ромни,
        [Display(Name = "Середина-Буда")]СерединаБуда, Суми, Тростянець, Шостка, Бережани = 253, Борщів, Бучач, Заліщики,
        Збараж, Зборів, Копичниці, Кременець, Ланівці, Монастирська, Підгайці, Почаїв, Скалат, Теребовля, Тернопіль,
        Хоростків, Чортків, Шумськ, Балаклія = 271, Барвінкове, Богодухів, Валки, Вовчанськ, Дергачі, Зміїв, Ізюм, 
        Красноград, [Display(Name = "Куп'янськ")]Купянськ, Лозова, Люботин, Мерефа, Первомайський, Південне, Харків, Чугуїв,
        Берислав = 288, Генічеськ, [Display(Name = "Гола Пристань")]ГолаПристань, Каховка, [Display(Name = "Нова Каховка")]НоваКаховка,
        Скадовськ, Таврійськ, Херсон, Цюрупинськ, Волочиськ = 297, Городoк, Деражня, Дунаївці, Ізяслав,
        [Display(Name = "Кам'янець-Подільський")]КамянецьПодільський, Красилів, Нетішин, Полонне, Славута, Старокостянтинів,
        Хмельницький, Шепетівка, Ватутіне = 310, Городище, Жашків, Звенигородка, Золотоноша, [Display(Name = "Кам'янка")]Камянка,
        Канів, [Display(Name = "Корсунь-Шевченківський")]КорсуньШевченківський, Монастирище, Сміла, Тальне, Умань, Христинівка,
        Черкаси, Чигирин, Шпола, Вашківці = 326, Вижниця, Герца, Заставна, Кіцмань, Новодністровськ, Новоселиця, Сокиряни, Сторожинець,
        Хотин, Чернівці, Батурин = 337, Бахмач, Бобровиця, Борзна, Городня, Ічня, Корюківка, Мена, Ніжин, 
        [Display(Name = "Новгород-Сіверський")]НовгородСіверський, Носівка, Остер, Прилуки, Семенівка, Чернігів, Щорс
    }

    public enum Roles {[Display(Name = "Користувач")]User = 1, [Display(Name = "Волонтер")]Volunteer, [Display(Name = "Водій")]Driver }

    public enum ResTypes { Амуніція = 1, Медикаменти, Продукти, Обладнання, Одяг }

    public enum ResMeasures { [Display(Name = "шт.")]шт = 1, л, кг, м, м2, м3 }

    public class User : IdentityUser
    {
        public async Task<ClaimsIdentity> GenerateUserIdentityAsync(UserManager<User> manager)
        {
            var userIdentity = await manager.CreateIdentityAsync(this, DefaultAuthenticationTypes.ApplicationCookie);

            userIdentity.AddClaim(new Claim("ActualName", this.Name));

            return userIdentity;
        }

        [Display(Name = "ПІБ")]
        public string Name { get; set; }

        [Display(Name = "Область")]
        public string State { get; set; }

        [Display(Name = "Місто")]
        public string City { get; set; }

        [Display(Name = "Адреса")]
        public string Address { get; set; }

        [Display(Name = "Дата народження")]
        public DateTime DateOfBirth { get; set; }
    }

    public class ApplicationDbContext : IdentityDbContext<User>
    {
        public ApplicationDbContext()
            : base("DefaultConnection", throwIfV1Schema: false)
        {
        }

        public static ApplicationDbContext Create()
        {
            return new ApplicationDbContext();
        }

        public virtual DbSet<Warehouse> Warehouses { get; set; }
        public virtual DbSet<ResWarehouses> ResTable { get; set; }
        public virtual DbSet<ResourceInfo> Resources { get; set; }
        public virtual DbSet<CustomerRequest> Requests { get; set; }
        public virtual DbSet<Car> Cars { get; set; }
    }
}